src/main/java/ru/vk/itmo/test/georgiidalbeev/lab2/wrk_result/full_result/32thread.txt
  128 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.20ms   20.32ms 190.21ms   85.63%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   11.03ms
 75.000%   26.61ms
 90.000%   45.95ms
 99.000%   89.73ms
 99.900%  132.86ms
 99.990%  173.95ms
 99.999%  187.01ms
100.000%  190.34ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.065     0.000000            1         1.00
       1.248     0.100000       133669         1.11
       1.987     0.200000       267291         1.25
       3.949     0.300000       400940         1.43
       7.143     0.400000       534519         1.67
      11.031     0.500000       668248         2.00
      13.319     0.550000       735024         2.22
      15.943     0.600000       801724         2.50
      18.975     0.650000       868612         2.86
      22.463     0.700000       935419         3.33
      26.607     0.750000      1002312         4.00
      28.911     0.775000      1035566         4.44
      31.455     0.800000      1069131         5.00
      34.271     0.825000      1102423         5.71
      37.631     0.850000      1136075         6.67
      41.567     0.875000      1169178         8.00
      43.679     0.887500      1186031         8.89
      45.951     0.900000      1202808        10.00
      48.479     0.912500      1219362        11.43
      51.519     0.925000      1236049        13.33
      55.103     0.937500      1252796        16.00
      57.151     0.943750      1261061        17.78
      59.391     0.950000      1269402        20.00
      61.951     0.956250      1277762        22.86
      64.863     0.962500      1286146        26.67
      68.223     0.968750      1294493        32.00
      70.207     0.971875      1298693        35.56
      72.447     0.975000      1302871        40.00
      74.943     0.978125      1307019        45.71
      77.951     0.981250      1311199        53.33
      81.279     0.984375      1315346        64.00
      83.135     0.985938      1317417        71.11
      85.375     0.987500      1319494        80.00
      88.063     0.989062      1321600        91.43
      90.879     0.990625      1323672       106.67
      94.399     0.992188      1325771       128.00
      96.575     0.992969      1326816       142.22
      98.943     0.993750      1327864       160.00
     101.631     0.994531      1328893       182.86
     104.767     0.995313      1329940       213.33
     108.287     0.996094      1330971       256.00
     110.335     0.996484      1331497       284.44
     112.447     0.996875      1332021       320.00
     114.623     0.997266      1332537       365.71
     117.439     0.997656      1333073       426.67
     120.383     0.998047      1333584       512.00
     121.983     0.998242      1333846       568.89
     123.903     0.998437      1334107       640.00
     126.463     0.998633      1334365       731.43
     129.791     0.998828      1334627       853.33
     133.375     0.999023      1334887      1024.00
     135.423     0.999121      1335019      1137.78
     137.727     0.999219      1335153      1280.00
     140.159     0.999316      1335279      1462.86
     143.359     0.999414      1335412      1706.67
     146.815     0.999512      1335542      2048.00
     148.735     0.999561      1335604      2275.56
     151.551     0.999609      1335672      2560.00
     153.855     0.999658      1335739      2925.71
     156.287     0.999707      1335799      3413.33
     158.975     0.999756      1335869      4096.00
     159.999     0.999780      1335897      4551.11
     162.303     0.999805      1335930      5120.00
     166.911     0.999829      1335963      5851.43
     169.727     0.999854      1335995      6826.67
     171.775     0.999878      1336027      8192.00
     173.055     0.999890      1336046      9102.22
     174.335     0.999902      1336061     10240.00
     175.487     0.999915      1336076     11702.86
     176.895     0.999927      1336098     13653.33
     177.663     0.999939      1336109     16384.00
     178.687     0.999945      1336119     18204.44
     179.583     0.999951      1336125     20480.00
     180.223     0.999957      1336133     23405.71
     181.119     0.999963      1336142     27306.67
     182.399     0.999969      1336150     32768.00
     182.783     0.999973      1336155     36408.89
     183.167     0.999976      1336159     40960.00
     183.551     0.999979      1336162     46811.43
     184.447     0.999982      1336166     54613.33
     185.343     0.999985      1336170     65536.00
     185.727     0.999986      1336172     72817.78
     186.239     0.999988      1336174     81920.00
     186.623     0.999989      1336176     93622.86
     187.135     0.999991      1336178    109226.67
     187.647     0.999992      1336180    131072.00
     187.775     0.999993      1336181    145635.56
     188.159     0.999994      1336182    163840.00
     188.287     0.999995      1336183    187245.71
     188.415     0.999995      1336184    218453.33
     188.799     0.999996      1336186    262144.00
     188.799     0.999997      1336186    291271.11
     188.799     0.999997      1336186    327680.00
     188.927     0.999997      1336187    374491.43
     188.927     0.999998      1336187    436906.67
     189.311     0.999998      1336188    524288.00
     189.311     0.999998      1336188    582542.22
     189.311     0.999998      1336188    655360.00
     189.695     0.999999      1336189    748982.86
     189.695     0.999999      1336189    873813.33
     189.695     0.999999      1336189   1048576.00
     189.695     0.999999      1336189   1165084.44
     189.695     0.999999      1336189   1310720.00
     190.335     0.999999      1336190   1497965.71
     190.335     1.000000      1336190          inf
#[Mean    =       18.197, StdDeviation   =       20.321]
#[Max     =      190.208, Total count    =      1336190]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  1336318 requests in 9.87s, 92.12MB read
  Non-2xx or 3xx responses: 238769
Requests/sec: 135401.62
Transfer/sec:      9.33MB